#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch.modules_master will be created
  + resource "github_branch" "modules_master" {
      + branch        = "master"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "modules"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # github_branch_default.modules will be created
  + resource "github_branch_default" "modules" {
      + branch     = "master"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "modules"
    }

  # github_organization_settings.nf-core will be created
  + resource "github_organization_settings" "nf-core" {
      + advanced_security_enabled_for_new_repositories               = false
      + billing_email                                                = (sensitive value)
      + blog                                                         = "http://nf-co.re"
      + default_repository_permission                                = "read"
      + dependabot_alerts_enabled_for_new_repositories               = false
      + dependabot_security_updates_enabled_for_new_repositories     = false
      + dependency_graph_enabled_for_new_repositories                = false
      + description                                                  = "A community effort to collect a curated set of analysis pipelines built using Nextflow."
      + email                                                        = "core@nf-co.re"
      + has_organization_projects                                    = true
      + has_repository_projects                                      = true
      + id                                                           = (known after apply)
      + members_can_create_internal_repositories                     = false
      + members_can_create_pages                                     = false
      + members_can_create_private_pages                             = false
      + members_can_create_private_repositories                      = false
      + members_can_create_public_pages                              = false
      + members_can_create_public_repositories                       = false
      + members_can_create_repositories                              = false
      + members_can_fork_private_repositories                        = false
      + name                                                         = "nf-core"
      + secret_scanning_enabled_for_new_repositories                 = false
      + secret_scanning_push_protection_enabled_for_new_repositories = false
      + twitter_username                                             = "nf_core"
      + web_commit_signoff_required                                  = false
    }

  # github_repository.modules will be created
  + resource "github_repository" "modules" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Repository to host tool-specific module files for the Nextflow DSL2 community!"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = false
      + homepage_url                = "https://nf-co.re"
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "modules"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "dsl2",
          + "modules",
          + "nextflow",
          + "nf-core",
          + "nf-test",
          + "pipelines",
          + "workflows",
        ]
      + visibility                  = "public"
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "disabled"
            }
          + secret_scanning_push_protection {
              + status = "disabled"
            }
        }
    }

  # github_repository.pipelines["methylseq"] will be created
  + resource "github_repository" "pipelines" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "methylseq"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false
    }

  # github_repository.pipelines["testpipeline"] will be created
  + resource "github_repository" "pipelines" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "testpipeline"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = (known after apply)
      + web_commit_signoff_required = false
    }

  # github_team.infrastructure will be created
  + resource "github_team" "infrastructure" {
      + create_default_maintainer = false
      + description               = "The best team according to them"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "infrastructure"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_members.infrastructure will be created
  + resource "github_team_members" "infrastructure" {
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "mashehu"
        }
      + members {
          + role     = "maintainer"
          + username = "mirpedrol"
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```

</details>

*Pusher: @renovate[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*